In [3]:
import pandas as pd
import numpy as np

In [4]:
data=np.random.randint(15000,50000,(3,3))

In [5]:
dataFrame=pd.DataFrame(data)

In [6]:
dataFrame

       0      1      2
0  43105  35426  21150
1  32027  16184  42713
2  29716  45642  36168

In [7]:
yeniDataFrame=pd.DataFrame(data,index=["Ahmet","Mehmet","Yavuz"])

In [8]:
yeniDataFrame

            0      1      2
Ahmet   43105  35426  21150
Mehmet  32027  16184  42713
Yavuz   29716  45642  36168

In [9]:
yeniDataFrame=pd.DataFrame(data,index=["Ahmet","Mehmet","Yavuz"],columns=[2018,2019,2020])

In [10]:
yeniDataFrame

         2018   2019   2020
Ahmet   43105  35426  21150
Mehmet  32027  16184  42713
Yavuz   29716  45642  36168

In [11]:
yeniDataFrame[2019]

Ahmet     35426
Mehmet    16184
Yavuz     45642
Name: 2019, dtype: int32

In [12]:
yeniDataFrame[2018]

Ahmet     43105
Mehmet    32027
Yavuz     29716
Name: 2018, dtype: int32

In [13]:
yeniDataFrame.loc["Ahmet"]

2018    43105
2019    35426
2020    21150
Name: Ahmet, dtype: int32

In [14]:
yeniDataFrame.iloc[2]

2018    29716
2019    45642
2020    36168
Name: Yavuz, dtype: int32

In [19]:
yeniDataFrame[2021]= yeniDataFrame[2020] + yeniDataFrame[2019]

In [20]:
yeniDataFrame

         2018   2019   2020   2021
Ahmet   43105  35426  21150  56576
Mehmet  32027  16184  42713  58897
Yavuz   29716  45642  36168  81810

In [21]:
yeniDataFrame.drop(2018,axis=1)

         2019   2020   2021
Ahmet   35426  21150  56576
Mehmet  16184  42713  58897
Yavuz   45642  36168  81810

In [22]:
yeniDataFrame.drop("Mehmet",axis=0)

        2018   2019   2020   2021
Ahmet  43105  35426  21150  56576
Yavuz  29716  45642  36168  81810

In [23]:
yeniDataFrame

         2018   2019   2020   2021
Ahmet   43105  35426  21150  56576
Mehmet  32027  16184  42713  58897
Yavuz   29716  45642  36168  81810

In [24]:
yeniDataFrame.drop(2018,axis=1,inplace=True)

In [25]:
yeniDataFrame

         2019   2020   2021
Ahmet   35426  21150  56576
Mehmet  16184  42713  58897
Yavuz   45642  36168  81810

In [27]:
yeniDataFrame.loc["Ahmet",2019]

35426

In [29]:
yeniDataFrame [yeniDataFrame> 36168]

           2019     2020   2021
Ahmet       NaN      NaN  56576
Mehmet      NaN  42713.0  58897
Yavuz   45642.0      NaN  81810

In [30]:
yeniDataFrame > 36168

         2019   2020  2021
Ahmet   False  False  True
Mehmet  False   True  True
Yavuz    True  False  True

In [37]:
yeniDataFrame [yeniDataFrame[2021]>57000]

         2019   2020   2021
Mehmet  16184  42713  58897
Yavuz   45642  36168  81810

In [38]:
yeniDataFrame.reset_index()

    index   2019   2020   2021
0   Ahmet  35426  21150  56576
1  Mehmet  16184  42713  58897
2   Yavuz  45642  36168  81810

In [48]:
yeniIndexListesi=["Alp","Yvz","Fth"]
yeniDataFrame["Yeni index"] = yeniIndexListesi

In [49]:
yeniDataFrame

         2019   2020   2021 Yeni index
Ahmet   35426  21150  56576        Alp
Mehmet  16184  42713  58897        Yvz
Yavuz   45642  36168  81810        Fth

In [59]:
yeniDataFrame.set_index("Yeni index",inplace=True)

In [60]:
yeniDataFrame

             2019   2020   2021
Yeni index
Alp         35426  21150  56576
Yvz         16184  42713  58897
Fth         45642  36168  81810

In [61]:
ilkIndexler=["VAR","VAR","VAR","DOĞAN","DOĞAN","DOĞAN","YILMAZ","YILMAZ","YILMAZ"]
icIndexler=["Alperen","Fatih","Yavuz","Tuba","Büşra","Furkan","Hümeyra","Enes","Emre"]
birlesmisIndex=list(zip(ilkIndexler,icIndexler))

In [62]:
birlesmisIndex

[('VAR', 'Alperen'),
 ('VAR', 'Fatih'),
 ('VAR', 'Yavuz'),
 ('DOĞAN', 'Tuba'),
 ('DOĞAN', 'Büşra'),
 ('DOĞAN', 'Furkan'),
 ('YILMAZ', 'Hümeyra'),
 ('YILMAZ', 'Enes'),
 ('YILMAZ', 'Emre')]

In [63]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [64]:
birlesmisIndex

MultiIndex([(   'VAR', 'Alperen'),
            (   'VAR',   'Fatih'),
            (   'VAR',   'Yavuz'),
            ( 'DOĞAN',    'Tuba'),
            ( 'DOĞAN',   'Büşra'),
            ( 'DOĞAN',  'Furkan'),
            ('YILMAZ', 'Hümeyra'),
            ('YILMAZ',    'Enes'),
            ('YILMAZ',    'Emre')],
           )

In [69]:
yasMeslek=[[26,"Müh"],[21,"Ö"],[15,"Ö"],[34,"Öğr"],[30,"Ev"],[27,"Bnk"],[34,"Öğr"],[31,"Kmr"],[25,"Ö"]]

In [70]:
yasMeslekNumpy=np.array(yasMeslek)

In [71]:
aileDataFrame=pd.DataFrame(yasMeslekNumpy,index=birlesmisIndex,columns=["yas","meslek"])

In [72]:
aileDataFrame

               yas meslek
VAR    Alperen  26    Müh
       Fatih    21      Ö
       Yavuz    15      Ö
DOĞAN  Tuba     34    Öğr
       Büşra    30     Ev
       Furkan   27    Bnk
YILMAZ Hümeyra  34    Öğr
       Enes     31    Kmr
       Emre     25      Ö

In [75]:
aileDataFrame.loc["VAR"]

        yas meslek
Alperen  26    Müh
Fatih    21      Ö
Yavuz    15      Ö

In [76]:
aileDataFrame.loc["DOĞAN"].loc["Furkan"]

yas        27
meslek    Bnk
Name: Furkan, dtype: object

In [80]:
aileDataFrame.index.names=["Aile","İsim"]

In [81]:
aileDataFrame

               yas meslek
Aile   İsim
VAR    Alperen  26    Müh
       Fatih    21      Ö
       Yavuz    15      Ö
DOĞAN  Tuba     34    Öğr
       Büşra    30     Ev
       Furkan   27    Bnk
YILMAZ Hümeyra  34    Öğr
       Enes     31    Kmr
       Emre     25      Ö